# WRITE  BY joker
# PLUGIN FOR joker 
# @jepthon

from telethon import events
import random, re
from ..Config import Config

from joker.utils import admin_cmd

import asyncio
from joker import l313l
from random import choice

from ..core.managers import edit_or_reply
from ..sql_helper.globals import gvarstatus

plugin_category = "extra"

Command = Config.COMM_ET or "الاوامر"

rehu = [
    "أن تكونَ عزيزاً غائباً.. أفضلُ بكثير من أن تكونَ حاضراً بلا قيم",
    "أنت ِجميلة رغم صمت",
    "ﺂصنع لنفسڪك شخخصيةه ولا تقلد احد 🤦🏻‍♂🖤",
    "ڪان يـا مكان وجمدانـي احتل المـكان 😂",
    "فاكرينها سهله ولاد الجهلة 🖤ُ",
    "اللي فات انسووه واللي جاي استنووه🧿🤍🦅*",
    "اهــتــمــامــي حــلــو بــس اهــمــالــي أجــمــد💆🏻‍♀️💋ِ",
    "*الـــســـجـــاره اطـــفـــت والـــصـــحـــاب اخـــتـــفـــتــ🔥⚔️*",
    "شباب فاكهه و الزمن نkها ❌😎",
    "لا تسمح لأحد أن يعاملك بمزاجه المتقلب، إما أن يعاملك بما يليق بك، أو دعه لمن يليق به💜",
    "‏قليلًا من التفاؤل قد يصنع ألف طريقاً للسعادة💜َّ",
    "وبعضهم  كقطع السكر تحلي مرارة الأيام💜",
    "‏راحتي النفسيه متعوب عليها ف ما تستغرب لما فجأة اطيرك من حياتي  ..",
    "اوعا تنسى اللي في يوم باعك",
    "مفيش مقارنة انـــت اخــــــڕڬ تشووف صــــوورنا ",
    "خليك زيي البحرر تتحب ويتخاف منك...💖",
    "صاحب البار مبيسكرش عشان يتفرج 🔞✌ع المساطيل 🚭😏",
    "اللى ميصونش سرك معرفتوا #تعرك ... 👌",
]
@l313l.on(admin_cmd(pattern=f"{Command}(?:\s|$)([\s\S]*)"))
async def _(event):
     if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
        lMl10l = random.choice(rehu)
        await event.edit(
        f": **⦑ قائمة اوامر كرستين ⦒**\n♡•━─⊶©•𝙲.𝚁 𝚂𝙾𝚄𝚁𝙲𝙴•®⊷─━•♡\n( `.م1` )  ⦙ **اوامر الادمن**\n( `.م2` )  ⦙ **اوامر المجموعة**\n( `.م3` )  ⦙ **اوامر الترحيب والردود**\n( `.م4` )  ⦙ **حماية خاص والتلكراف**\n( `.م5` )  ⦙ **اوامر المنشن والانتحال**\n( `.م6` )  ⦙ **اوامر التحميل والترجمة**\n( `.م7` )  ⦙ **اوامر المنع و القفل**\n( `.م8` )  ⦙ **اوامر التنظيف والتكرار**\n( `.م9` )  ⦙ **اوامر التخصيص والفارات**\n( `.م10` ) ⦙ **اوامر الوقتي و التشغيل**\n( `.م11` ) ⦙ **اوامر الكشف و الروابط**\n( `.م12` ) ⦙ **اوامر المساعدة والإذاعة** \n( `.م13` ) ⦙ **اوامر الارسال والاذكار**\n( `.م14` ) ⦙ **اوامر المـلصقات وكوكل**\n( `.م15` ) ⦙ **اوامر التسلية والميمز والتحشيش** \n( `.م16` ) ⦙ **اوامر الصيغ والجهات**\n( `.م17` ) ⦙ **اوامر التمبلر والزغرفة والمتحركة**\n( `.م18` ) ⦙ **اوامر الحساب والترفيه**\n( `.م19` ) ⦙ **اوامر الميوزك والتشغيل**\n( `.م20` ) ⦙ **اوامر بصمات الميمز**\n( `.م21` ) ⦙ **اوامــر الستـوريـات**\n( `.م22` ) ⦙ **اوامــر الآفتـــارات والصــور**\n( `.م23` ) ⦙ **اوامر الهمسه**\n( `.م24` ) ⦙ **اوامــر تجميــع النقــاط**\n( `.م25` ) ⦙ **اوامــر الصيـد & التشيكـر**\n( `.م26` ) ⦙ **اوامر الاشتــراك الاجبــاري**\n ♡•━─⊶©•𝙲.𝚁 𝚂𝙾𝚄𝚁𝙲𝙴•®⊷─━•♡\n **᯽︙ {lMl10l} **"
)

@l313l.ar_cmd(
    pattern="م1$",
    command=("م1", plugin_category),
)
async def _(event):
	if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
		await event.edit(
		"** قائمة اوامر الادمن لسورس كرستين **:\n ♡•━─⊶©•𝙲.𝚁 𝚂𝙾𝚄𝚁𝙲𝙴•®⊷─━•♡\n ᯽︙ اختر احدى هذه القوائم\n\n- ( `.اوامر الحظر` )\n- ( `.اوامر الكتم` )\n- ( `.اوامر التثبيت` )\n- ( `.اوامر الاشراف` )\n♡•━─⊶©•𝙲.𝚁 𝚂𝙾𝚄𝚁𝙲𝙴•®⊷─━•♡\n⌔︙CH : @S_EG_P"
)
		
@l313l.ar_cmd(
    pattern="م2$",
    command=("م2", plugin_category),
)
async def _(event):
	if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
		await event.edit(
		"** قائمة اوامر المجـموعه لسورس كرستين **:\n ♡•━─⊶©•𝙲.𝚁 𝚂𝙾𝚄𝚁𝙲𝙴•®⊷─━•♡\n ᯽︙ اختر احدى هذه القوائم\n\n- ( `.اوامر التفليش` )\n- ( `.اوامر المحذوفين` )\n- ( `.اوامر الكروب` )\n♡•━─⊶©•𝙲.𝚁 𝚂𝙾𝚄𝚁𝙲𝙴•®⊷─━•♡\n⌔︙CH : @S_EG_P"
)

@l313l.ar_cmd(
    pattern="م3$",
    command=("م3", plugin_category),
)
async def _(event):
	if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
		await event.edit(
		"** قائمة اوامر الـترحيب والـردود **:\n ♡•━─⊶©•𝙲.𝚁 𝚂𝙾𝚄𝚁𝙲𝙴•®⊷─━•♡\n ᯽︙ اختر احدى هذه القوائم\n\n- ( `.اوامر الترحيب` )\n- ( `.اوامر الردود` )\n♡•━─⊶©•𝙲.𝚁 𝚂𝙾𝚄𝚁𝙲𝙴•®⊷─━•♡\n⌔︙CH : @S_EG_P"
)
@l313l.ar_cmd(
    pattern="م4$",
    command=("م4", plugin_category),
)
async def _(event):
	if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
		await event.edit(
		"** قائمة اوامر حـماية الخاص والتلكراف **:\n ♡•━─⊶©•𝙲.𝚁 𝚂𝙾𝚄𝚁𝙲𝙴•®⊷─━•♡\n ᯽︙ اختر احدى هذه القوائم\n\n- ( `.اوامر الحماية` )\n- ( `.اوامر التلكراف` ) \n♡•━─⊶©•𝙲.𝚁 𝚂𝙾𝚄𝚁𝙲𝙴•®⊷─━•♡\n⌔︙CH : @S_EG_P"
)
@l313l.ar_cmd(
    pattern="م5$",
    command=("م5", plugin_category),
)
async def _(event):
	if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
		await event.edit(
		"** قائمة اوامر الـمنشن والانتحال **:\n ♡•━─⊶©•𝙲.𝚁 𝚂𝙾𝚄𝚁𝙲𝙴•®⊷─━•♡\n ᯽︙ اختر احدى هذه القوائم\n\n- ( `.اوامر الانتحال` )\n- ( `.اوامر التقليد` )\n- ( `.اوامر المنشن` ) \n♡•━─⊶©•𝙲.𝚁 𝚂𝙾𝚄𝚁𝙲𝙴•®⊷─━•♡\n⌔︙CH : @S_EG_P"
)

@l313l.ar_cmd(
    pattern="م6$",
    command=("م6", plugin_category),
)
async def _(event):
	if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
		await event.edit(
		"** قائمة اوامر التحميل والترجمه **:\n ♡•━─⊶©•𝙲.𝚁 𝚂𝙾𝚄𝚁𝙲𝙴•®⊷─━•♡\n ᯽︙ اختر احدى هذه القوائم\n\n- ( `.اوامر النطق` )\n- ( `.اوامر التحميل` )\n- ( `.اوامر الترجمة` ) \n♡•━─⊶©•𝙲.𝚁 𝚂𝙾𝚄𝚁𝙲𝙴•®⊷─━•♡\n⌔︙CH : @S_EG_P"
)

@l313l.ar_cmd(
    pattern="م7$",
    command=("م7", plugin_category),
)
async def _(event):
	if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
		await event.edit(
		"** قائمة اوامر القفل والمنع **:\n♡•━─⊶©•𝙲.𝚁 𝚂𝙾𝚄𝚁𝙲𝙴•®⊷─━•♡\n ᯽︙ اختر احدى هذه القوائم\n\n- ( `.اوامر القفل` )\n- ( `.اوامر الفتح` )\n- ( `.اوامر المنع` ) \n★♡•━─⊶©•𝙲.𝚁 𝚂𝙾𝚄𝚁𝙲𝙴•®⊷─━•♡★\n⌔︙CH : @S_EG_P"
)

@l313l.ar_cmd(
    pattern="م8$",
    command=("م8", plugin_category),
)
async def _(event):
	if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
		await event.edit(
		"** قائمة اوامر التكرار والتنظيف **:\n♡•━─⊶©•𝙲.𝚁 𝚂𝙾𝚄𝚁𝙲𝙴•®⊷─━•♡\n ᯽︙ اختر احدى هذه القوائم\n\n- ( `.اوامر التكرار` )\n- ( `.اوامر السبام` )\n- ( `.اوامر التنظيف` ) \n- ( `.اوامر المسح` ) \n♡•━─⊶©•𝙲.𝚁 𝚂𝙾𝚄𝚁𝙲𝙴•®⊷─━•♡\n⌔︙CH : @S_EG_P"
)

@l313l.ar_cmd(
    pattern="م9$",
    command=("م9", plugin_category),
)
async def _(event):
	if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
		await event.edit(
		"** قائمة التخصيص والفارات **:\n ♡•━─⊶©•𝙲.𝚁 𝚂𝙾𝚄𝚁𝙲𝙴•®⊷─━•♡\n ᯽︙ اختر احدى هذه القوائم\n\n- ( `.اوامر التخصيص` )\n لتغير الصور والكلايش كل من الحماية والفحص والبنك\n- ( `.اوامر الفارات` )\n - لتغير الاسم وزخرفة الوقت والصورة الوقتية والمنطقة الزمنية ورمز الاسم والبايو الوقتي وغيرها\n♡•━─⊶©•𝙲.𝚁 𝚂𝙾𝚄𝚁𝙲𝙴•®⊷─━•♡\n⌔︙CH : @S_EG_P"
		)

@l313l.ar_cmd(
    pattern="م10$",
    command=("م10", plugin_category),
)
async def _(event):
	if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
		await event.edit(
		"** قائمة اوامر الوقتي والتشغيل **:\n ♡•━─⊶©•𝙲.𝚁 𝚂𝙾𝚄𝚁𝙲𝙴•®⊷─━•♡\n ᯽︙ اختر احدى هذه القوائم\n\n- ( `.اوامر الاسم` )\n- ( `.اوامر البايو` )\n- ( `.اوامر الكروب الوقتي` )\n- ( `.اوامر التشغيل` ) \n- ( `.اوامر الاطفاء` ) \n♡•━─⊶©•𝙲.𝚁 𝚂𝙾𝚄𝚁𝙲𝙴•®⊷─━•♡\n⌔︙CH : @S_EG_P"
)	

@l313l.ar_cmd(
    pattern="م11$",
    command=("م11", plugin_category),
)
async def _(event):
	if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
		await event.edit(
		"** قائمة اوامر الكـشف و الروابط **:\n ♡•━─⊶©•𝙲.𝚁 𝚂𝙾𝚄𝚁𝙲𝙴•®⊷─━•♡\n ᯽︙ اختر احدى هذه القوائم\n\n- ( `.اوامر الكشف` )\n- ( `.اوامر الروابط` ) \n\n ♡•━─⊶©•𝙲.𝚁 𝚂𝙾𝚄𝚁𝙲𝙴•®⊷─━•♡\n⌔︙CH : @S_EG_P"
)
@l313l.ar_cmd(
    pattern="م12$",
    command=("م12", plugin_category),
)
async def _(event):
	if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
		await event.edit(
		"** قائمة اوامر المساعدة  **:\n ♡•━─⊶©•𝙲.𝚁 𝚂𝙾𝚄𝚁𝙲𝙴•®⊷─━•♡\n ᯽︙ اختر احدى هذه القوائم\n\n- ( `.اوامر الوقت والتاريخ` )\n- ( `.اوامر كورونا` )\n- ( `.اوامر الصلاة` ) \n- ( `.اوامر مساعدة` )\n- ( `.اوامر الاذاعه` ) \n♡•━─⊶©•𝙲.𝚁 𝚂𝙾𝚄𝚁𝙲𝙴•®⊷─━•♡\n⌔︙CH : @S_EG_P"
)
@l313l.ar_cmd(
    pattern="م13$",
    command=("م13", plugin_category),
)
async def _(event):
	if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
		await event.edit(
		"** قائمة اوامر الارسال **:\n ♡•━─⊶©•𝙲.𝚁 𝚂𝙾𝚄𝚁𝙲𝙴•®⊷─━•♡\n ᯽︙ اختر احدى هذه القوائم\n\n- ( `.امر الصورة الذاتية` )\n- ( `.اوامر التحذيرات` )\n- ( `.اوامر اللستة` )\n- ( `.اوامر الملكية` ) \n- ( `.اوامر السليب` ) \n- ( `.اوامر الاذكار` )\n♡•━─⊶©•𝙲.𝚁 𝚂𝙾𝚄𝚁𝙲𝙴•®⊷─━•♡\n⌔︙CH : @S_EG_P"
)
@l313l.ar_cmd(
    pattern="م14$",
    command=("م14", plugin_category),
)
async def _(event):
	if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
		await event.edit(
		"** قائمة اوامر الملصقات وكوكل **:\n ♡•━─⊶©•𝙲.𝚁 𝚂𝙾𝚄𝚁𝙲𝙴•®⊷─━•♡\n ᯽︙ اختر احدى هذه القوائم\n\n- ( `.اوامر الملصقات` )\n- ( `.اوامر كوكل` )\n♡•━─⊶©•𝙲.𝚁 𝚂𝙾𝚄𝚁𝙲𝙴•®⊷─━•♡\n⌔︙CH : @S_EG_P"
)

@l313l.ar_cmd(
    pattern="م15$",
    command=("م15", plugin_category),
)
async def _(event):
	if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
		await event.edit(
		"** قائمة اوامر التسلية والتحشيش **:\n ♡•━─⊶©•𝙲.𝚁 𝚂𝙾𝚄𝚁𝙲𝙴•®⊷─━•♡\n ᯽︙ اختر احدى هذه القوائم\n\n- ( `.اوامر التسلية` )\n- ( `.اوامر التحشيش` )\n- ( `.اوامر الميمز` )\n♡•━─⊶©•𝙲.𝚁 𝚂𝙾𝚄𝚁𝙲𝙴•®⊷─━•♡\n⌔︙CH : @S_EG_P"
)

@l313l.ar_cmd(
    pattern="م16$",
    command=("م16", plugin_category),
)
async def _(event):
	if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
		await event.edit(
		"** قائمة اوامر تحويل الصيغ و الجهات **:\n ♡•━─⊶©•𝙲.𝚁 𝚂𝙾𝚄𝚁𝙲𝙴•®⊷─━•♡\n ᯽︙ اختر احدى هذه القوائم\n\n- ( `.اوامر التحويل` )\n- ( `.اوامر الجهات` ) \n♡•━─⊶©•𝙲.𝚁 𝚂𝙾𝚄𝚁𝙲𝙴•®⊷─━•♡\n⌔︙CH : @S_EG_P"
)

@l313l.ar_cmd(
    pattern="م18$",
    command=("م18", plugin_category),
)
async def _(event):
	if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
		await event.edit(
		"** قائمة اوامر الحساب و الترفيه **:\n ♡•━─⊶©•𝙲.𝚁 𝚂𝙾𝚄𝚁𝙲𝙴•®⊷─━•♡\n ᯽︙ اختر احدى هذه القوائم\n\n- ( `.اوامر الترفيه` )\n- ( `.اوامر الحساب` ) \n♡•━─⊶©•𝙲.𝚁 𝚂𝙾𝚄𝚁𝙲𝙴•®⊷─━•♡\n⌔︙CH : @S_EG_P"

)

@l313l.ar_cmd(
    pattern="م19",
    command=("م19", plugin_category),
)
async def _(event):
     if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
        await event.edit(
        " قائمة اوامر الميوزك والتشغيل 🎵\n ♡•━─⊶©•𝙲.𝚁 𝚂𝙾𝚄𝚁𝙲𝙴•®⊷─━•♡\n᯽︙ اختر احدى هذه الاوامر\n ᯽︙ قبل أستخدام هذه الاوامر يجب تفعيل المود بكتابة ألامر ( `.ميوزك تفعيل` ) \n- ( `.تشغيل_المكالمة` )\n- لتشغيل المحادثة الصوتيه\n- ( `.انهاء_المكالمة` )\n-لأنهاء المحادثه الصوتية \n- ( `.دعوة` )\n- بالرد على الشخص لدعوته الى المكالمة \n- ( `.معلومات_المكالمة` )\n- لعرض عنوان المكالمة وعدد لاشخاص الموجودين فيها \n- ( `.تسمية_المكالمة` )\n- لتغير عنوان المكالمة \n- ( `.انضمام` )\n- للأنضمام الى المحادثة الصوتية\n- ( `.مغادرة` )\n- لمغادرة المحادثة الصوتية \n- ( `.تشغيل` )\n-بالرد على رابط اليوتيوب او كتابة الامر مع رابط ليوتيوب لتشغيل الاغنيه \n- ( `.قائمة_التشغيل` )\n- لعرض قائمة التشغيل \n- ( `.ايقاف_مؤقت` )\n - لأيقاف الاغنية الحالية مؤقتا \n- ( `.استمرار` )\n -لأستمرار الاغنيه التي تم ايقافها \n- ( `.تخطي` )\n- لتخطي الاغنيه وتشغيل الاغنيه الموجوده في قائمة التشغيل \n\n ♡•━─⊶©•𝙲.𝚁 𝚂𝙾𝚄𝚁𝙲𝙴•®⊷─━•♡\n⌔︙CH : @S_EG_P"



)

@l313l.ar_cmd(
    pattern="م20$",
    command=("م20", plugin_category),
)
async def _(event):
	if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
		await event.edit(
		"** قائمة اوامر بصمات الميمز **:\n ♡•━─⊶©•𝙲.𝚁 𝚂𝙾𝚄𝚁𝙲𝙴•®⊷─━•♡\n ᯽︙ اختر احدى هذه القوائم\n\n- ( `.بصمات ميمز` )\n- ( `.بصمات ميمز2` )\n- ( `.بصمات ميمز3` )\n- ( `.بصمات ميمز4` )\n- ( `.بصمات ميمز5` )\n- ( `.بصمات انمي` ) \n♡•━─⊶©•𝙲.𝚁 𝚂𝙾𝚄𝚁𝙲𝙴•®⊷─━•♡\n⌔︙CH : @S_EG_P"

)

@l313l.ar_cmd(
    pattern="م21$",
    command=("م21", plugin_category),
)
async def _(event):
	if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
		await event.edit(
		"[ᯓ 𝙲.𝚁 𝚂𝙾𝚄𝚁𝙲𝙴 - اوامــر الستـوريـات 🎆🏖](t.me/S_EG_P) .\n\n**⎞𝟏⎝** `.حالات واتس`\n**- اكثـر مـن 2000 فيديـو حالات واتسـاب قصيـرة 🎬**\n\n**⎞𝟐⎝**`.ستوري انمي`\n**- مقاطـع ستوريـات انمـي قصيـرة 🎞**\n\n**⎞𝟑⎝** `.ادت`\n**- مقاطـع ادت منـوعـة 🎥**\n\n**⎞𝟒⎝** `.رياكشن`\n**- مقاطـع رياكشـن ترفيهيــه 📺**\n\n**⎞𝟓⎝** `.ميمز`\n**- بصمـات ميمـز تحشيـش 🎃**\n\n**⎞𝟔⎝** `.غنيلي`\n**- مقاطـع اغـانـي قصيـره 🎶**\n\n**⎞𝟕⎝** `.شعر`\n**- مقاطـع صـوت شعـريـه 🎙**\n\n\n 𓆩 [𝙲.𝚁 𝚂𝙾𝚄𝚁𝙲𝙴](t.me/S_EG_P) 𓆪")
)

@l313l.ar_cmd(
    pattern="م22$",
    command=("م22", plugin_category),
)
async def _(event):
	if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
		await event.edit(
		   
		"[ᯓ 𝙲.𝚁 𝚂𝙾𝚄𝚁𝙲𝙴 - اوامــر الآفتـــارات والصــور 🎆🏖](t.me/S_EG_P) .\n\n**⎞𝟏⎝** `.ولد انمي`\n**- اكثـر مـن 2500 آفتـار آنمـي شبـاب 🙋🏻‍♂🎆**\n\n**⎞𝟐⎝**`.بنت انمي`\n**- اكثـر مـن 1800 آفتـار آنمـي بنـات 🙋🏻‍♀🎆**\n\n**⎞𝟑⎝** `.رمادي`\n**- آفتـارات شبـاب رمـاديـه 🏂🏙**\n\n**⎞𝟒⎝** `.رماديه`\n**- آفتـارات بنـات رمـاديـه ⛹🏻‍♀🌁**\n\n**⎞𝟓⎝** `.بيست`\n**- آفتـارات بيست تطقيـم بنـات 👯‍♀🏖**\n\n**⎞𝟔⎝** `.حب`\n**- آفتـارات بيست تطقيـم حب ♥️🧚‍♂🧚‍♀**\n\n**⎞𝟕⎝** `.بنات`\n**- اكثـر مـن 2500 آفتـارات بنـات تمبلـر 💅🎆**\n\n**⎞𝟖⎝** `.ري اكشن`\n**- صـور رياكشـن تحشيـش 🎃😹**\n\n**⎞𝟗⎝** `.معلومه`\n**- صـوره ومعلومـه معلومـات عـامـه 🗺**\n\n\n 𓆩 [𝙲.𝚁 𝚂𝙾𝚄𝚁𝙲𝙴](t.me/S_EG_P) 𓆪"

@l313l.ar_cmd(
    pattern="م24$",
    command=("م24", plugin_category),
)
async def _(event):
	if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
		await event.edit(
		   
		"[ᯓ 𝙲.𝚁 𝚂𝙾𝚄𝚁𝙲𝙴 - اوامــر تجميــع النقــاط 🛂](t.me/S_EG_P) .\n\n**✾╎قـائمـة اوامـر تجميـع نقـاط بوتـات تمـويـل الخاص بسـورس كرستين 🦾 :** \n\n**⎞𝟏⎝** `.المليار`\n**⪼ لـ تجميـع النقـاط مـن بـوت المليـار ( @t06bot ) .. تلقـائيـاً ✓**\n\n**⎞𝟐⎝** `.الجوكر`\n**⪼ لـ تجميـع النقـاط مـن بـوت الجوكـر ( @A_MAN9300BOT ) .. تلقـائيـاً ✓**\n\n**⎞𝟑⎝** `.الجنرال`\n**⪼ لـ تجميـع النقـاط مـن بـوت الجنــرال ( @MARKTEBOT ) .. تلقـائيـاً ✓**\n\n**⎞𝟒⎝** `.المليون`\n**⪼ لـ تجميـع النقـاط مـن بـوت المليــون ( @qweqwe1919bot ) .. تلقـائيـاً ✓**\n\n\n**⎞𝟓⎝** `.ايقاف المليار`\n**⪼ لـ ايقـاف عمليـة تجميـع النقـاط من بوت المليـار ..**\n\n**⎞𝟔⎝** `.ايقاف الجوكر`\n**⪼ لـ ايقـاف عمليـة تجميـع النقـاط من بوت الجوكـر ..**\n\n**⎞𝟕⎝** `.ايقاف الجنرال`\n**⪼ لـ ايقـاف عمليـة تجميـع النقـاط من بوت الجنــرال ..**\n\n**⎞𝟖⎝** `.ايقاف المليون`\n**⪼ لـ ايقـاف عمليـة تجميـع النقـاط من بوت المليــون ..**\n\n\n 𓆩 [𝙲.𝚁 𝚂𝙾𝚄𝚁𝙲𝙴](t.me/S_EG_P) 𓆪")
		
@l313l.ar_cmd(
    pattern="م25$",
    command=("م25", plugin_category),
)
async def _(event):
	if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
		await event.edit(
		   
		"[ᯓ 𝙲.𝚁 𝚂𝙾𝚄𝚁𝙲𝙴 - اوامــر الصيـد & التشيكـر ❇️](t.me/S_EG_P) .\n\n**✾╎قـائمـة اوامـر تشيكـر صيـد معـرفات تيليجـرام :**\n\n**النـوع :**\n**(** `سداسي حرفين`/`ثلاثيات`/`سداسيات`/`بوتات`/`خماسي حرفين`/`خماسي`/`سباعيات` **)**\n\n**⎞𝟏⎝** `.صيد` + النـوع\n**⪼ لـ صيـد يـوزرات عشوائيـه على حسب النـوع**\n\n**⎞𝟐⎝** `.تثبيت` + اليـوزر\n**⪼ لـ تثبيت اليـوزر بقنـاة معينـه اذا اصبح متاحـاً يتم اخـذه**\n\n**⎞𝟑⎝** `.حالة الصيد`\n**⪼ لـ معرفـة حالـة تقـدم عمليـة الصيـد**\n\n**⎞𝟒⎝** `.حالة التثبيت`\n**⪼ لـ معرفـة حالـة تقـدم التثبيت التلقـائـي**")

@l313l.ar_cmd(
    pattern="م26$",
    command=("م26", plugin_category),
)
async def _(event):
	if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
		await event.edit(
		   
		"[ᯓ 𝙲.𝚁 𝚂𝙾𝚄𝚁𝙲𝙴 - اوامــر الاشتــراك الاجبــاري 🛗](t.me/S_EG_P) .\n\n**✾╎قـائمـة اوامـر الاشتـراك الاجبـاري الخاص بسـورس كرستين 🦾 :**\n\n**- اولاً اوامـر اضافـة القنـاة المطلوبـه للفـارات :**\n\n**⎞𝟏⎝** `.ضع الاشتراك خاص` / `.وضع الاشتراك خاص`\n**⪼ لـ اضافة قناة اشتراك الخاص للفارات .. استخدم الامر + معرف القناة او الامر داخل القناة ✓**\n\n**⎞𝟐⎝** `.ضع الاشتراك كروب` / `.وضع الاشتراك كروب`\n**⪼ لـ اضافة قناة اشتراك الكروب للفارات .. استخدم الامر + معرف القناة داخل الكروب ✓**\n\n\n**- ثانيـاً اوامـر تفعيـل الاشتـراك بعـد اضافة القنـاة :**\n\n**⎞𝟑⎝**`.اشتراك خاص`\n**⪼ لـ تفعيـل الاشتـراك الاجبـاري للخـاص بعـد اضافة الفـار ✓**\n\n**⎞𝟒⎝** `.اشتراك كروب`\n**⪼ لـ تفعيـل الاشتـراك الاجبـاري للكروب بعـد اضافة الفـار .. استخدم الامر داخل الكروب ✓**\n\n\n**- ثالثـاً اوامـر تعطيـل الاشتــراك :**\n\n**⎞𝟓⎝** `.تعطيل اشتراك الخاص` / `.تعطيل خاص`\n**⪼ لـ تعطيـل الاشتـراك الاجبـاري للخـاص اذا كـان مفعـل ✓**\n\n**⎞𝟔⎝** `.تعطيل اشتراك الكروب` / `.تعطيل كروب`\n**⪼ لـ تعطيـل الاشتـراك الاجبـاري للكـروب اذا كـان مفعـل ✓**\n\n\n 𓆩 [𝙲.𝚁 𝚂𝙾𝚄𝚁𝙲𝙴](t.me/S_EG_P) 𓆪")
